"use strict";
// Задача 1: З клавіатури вводяться імена двох дітей та кількість у них цукерок. Вивести не екран ім’я тієї дитини, у якої кількість цукерок є більшою, або вивести, що кількість однакова.
//1. Введення даних:
const firstChild = prompt("Будь ласка, введіть ім’я першої дитини:");
const secondChild = prompt("Будь ласка, введіть ім’я другої дитини:");
const firstChildsCandies = parseInt(prompt("Будь ласка, введіть кількість цукерок, які має перша дитина:"));
const secondChildsCandies = parseInt(prompt("Будь ласка, введіть кількість цукерок, які має друга дитина:"));
let result;
//2. Обчислення
//2.1 Якщо перша дитина має більше цукерок ніж друга:
if (firstChildsCandies > secondChildsCandies) {
    result = "більше";
    //2.2 Якщо друга дитина має більше цукерок ніж перша:
}
else if (firstChildsCandies < secondChildsCandies) {
    result = "менше";
    //2.1 Якщо обидві дитини мають однакову кількість цукерок :
}
else {
    result = "стільки ж";
}
