"use strict";
// Задача 2: З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.
//1. Введення даних:
const productPrice = parseFloat(prompt("Введіть ціну товару"));
const userMoney = parseFloat(prompt("Введіть кількість грошей, які ви маєте:"));
//2. Розв'язок та вивід на сторінку
if (userMoney < productPrice || userMoney === 0) {
    alert("Вибачте, у вас не вистачає коштів");
}
else {
    alert("Вітаю з покупкою");
    if (userMoney - productPrice >= 4) {
        alert("У вас є можливість купити лотерею");
    }
}
